; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	image0 - mode
	Star3 - direction
	Star4 - direction
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star1)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument4 image0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star2)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 image1)
	(calibration_target instrument6 Star0)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star1)
	(supports instrument8 image0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet7)
)
(:goal (and
	(pointing satellite3 Star6)
	(have_image Star6 image0)
	(have_image Planet8 image0)
	(have_image Phenomenon9 image0)
	(have_image Planet10 image0)
	(have_image Star11 image1)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 6
2. (calibrate satellite2 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 0 of 6
3. (turn_to satellite2 planet8 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet8)
   goals met: 0 of 6
4. (take_image satellite2 planet8 instrument5 image0)
   added: (have_image planet8 image0)
   goals met: 1 of 6
5. (turn_to satellite2 planet10 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet10)
   goals met: 1 of 6
6. (take_image satellite2 planet10 instrument5 image0)
   added: (have_image planet10 image0)
   goals met: 2 of 6
7. (turn_to satellite2 phenomenon9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 6
8. (take_image satellite2 phenomenon9 instrument5 image0)
   added: (have_image phenomenon9 image0)
   goals met: 3 of 6
9. (turn_to satellite2 star11 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star11)
   goals met: 3 of 6
10. (take_image satellite2 star11 instrument5 image1)
   added: (have_image star11 image1)
   goals met: 4 of 6
11. (turn_to satellite2 star6 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star6)
   goals met: 4 of 6
12. (take_image satellite2 star6 instrument5 image0)
   added: (have_image star6 image0)
   goals met: 5 of 6
13. (turn_to satellite3 star6 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star6)
   goals met: 6 of 6
